<?php

declare(strict_types = 1);

namespace CloudCastle\EquifaxLibrary;

use CloudCastle\EquifaxLibrary\AbstractClasses\AbstractBook;

/**
 * Класс ListOfEventsForTheTransferOfCreditHistory
 * @version 0.0.1
 * @package CloudCastle\EquifaxLibrary
 * @generated Зорин Алексей, please DO NOT EDIT!
 * @author Зорин Алексей <zorinalexey59292@gmail.com>
 * @copyright 2022 разработчик Зорин Алексей Евгеньевич.
 */
class ListOfEventsForTheTransferOfCreditHistory extends AbstractBook
{

    /**
     * Значение по умолчанию
     * @var string
     */
    private string $default = '1.1';

    /**
     * Коллекция возможных вариантов запроса по справочнику
     * @var array
     */
    private array $data = [
        'Субъект обратился к источнику с предложением совершить сделку' => '1.1',
        'Источник одобрил обращение субъекта (направил ему оферту) или изменились сведения об обращении' => '1.2',
        'Источник отказался от совершения сделки по обращению субъекта' => '1.3',
        'Субъект и источник совершили сделку, кроме договора лизинга и поручительства по лизингу' => '1.4',
        'Субъект и источник заключили договор лизинга либо поручительства по лизингу и предмет лизинга передан лизингополучателю' => '1.4.1',
        'Для принудительного исполнения передано требование о взыскании долга по алиментам, платы за жилое помещение, коммунальные услуги или услуги связи' => '1.5',
        'Изменились сведения о взыскании долга по алиментам, платы за жилое помещение, коммунальные услуги или услуги связи либо указанное требование погашено' => '1.6',
        'Изменились сведения титульной части кредитной истории субъекта или о коде субъекта кредитной истории' => '1.7',
        'Изменились сведения о субъекте в основной части кредитной истории, кроме сведений о дееспособности, банкротстве' => '1.9',
        'Изменились сведения о дееспособности субъекта' => '1.10',
        'Изменились сведения по делу о банкротстве субъекта' => '1.12',
        'Изменились сведения об условиях обязательства субъекта' => '2.1',
        'Субъекту передана сумма займа (кредита) либо субъект стал принципалом по гарантии или поручителем по сделке, кроме договора лизинга' => '2.2',
        'Изменились сведения об исполнении обязательства субъектом, наступила ответственность поручителя или обязательство принципала возместить выплаченную сумму или прошло 30 календарных днейс предыдущего расчета сведений о задолженности' => '2.3',
        'Изменились сведения об обеспечении исполнения обязательства' => '2.4',
        'Обязательство субъекта прекратилось' => '2.5',
        'Изменились сведения о судебном споре или требовании по обязательству' => '2.6',
        'Открылось конкурсное производство в отношении источника' => '2.8.1',
        'В ходе конкурсного производства в отношении источника изменились сведения об исполнении субъектом своего обязательства или его части либо обязательство прекратилось' => '2.8.2',
        'Завершилось конкурсное производство в отношении источника' => '2.8.3',
        'Начался процесс ликвидации источника' => '2.9.1',
        'В ходе процесса ликвидации источника изменились сведения об исполнении субъектом своего обязательства или его части либо обязательство прекратилось' => '2.9.2',
        'Завершился процесс ликвидации источника' => '2.9.3',
        'Источник прекратил передачу информации по обязательству' => '2.10',
        'Права кредитора по обязательству перешли к другому лицу' => '2.11',
        'Изменились сведения об обслуживающей организации (в частности, заключен, изменен или расторгнут договор обслуживания)' => '2.12'
    ];

}
