<?php

declare(strict_types = 1);

namespace CloudCastle\EquifaxLibrary;

use CloudCastle\EquifaxLibrary\AbstractClasses\AbstractBook;

/**
 * Класс ReasonForGrantingOperationDProducedWithCreditHistoryRecord
 * @version 0.0.1
 * @package CloudCastle\EquifaxLibrary
 * @generated Зорин Алексей, please DO NOT EDIT!
 * @author Зорин Алексей <zorinalexey59292@gmail.com>
 * @copyright 2022 разработчик Зорин Алексей Евгеньевич.
 */
class ReasonForGrantingOperationDProducedWithCreditHistoryRecord extends AbstractBook
{

    /**
     * Коллекция возможных вариантов запроса по справочнику
     * @var array
     */
    private array $data = [
        'На основании пункта 2 части 1 статьи 7 218-ФЗ: на основании решения суда, вступившего в силу' => 2,
        'На основании пункта 3 части 1 статьи 7 218-ФЗ: по результатам рассмотрения указанного в части 3 статьи 8 Федерального закона No 218-ФЗ заявления субъекта кредитной истории в случае, если по результатам рассмотрения такого заявления принято решение о полном оспаривании информации, содержащейся в его кредитной истории' => 3,
        'На основании пункта 4 части 1 статьи 7 218-ФЗ: на основании обращения источника формирования кредитной истории, получившего копию акта Банка России о проведении контрольного мероприятия, предусмотренного частями четвертой и восьмой статьи 73.1-1 и частями седьмой и десятой статьи 76.5 Федерального закона от 10 июля 2002 года N 86-ФЗ "О Центральном банке Российской Федерации (Банке России)", в случае, если в рамках проведения такого контрольного мероприятия совершены действия, информация о которых подлежит направлению в бюро кредитных историй в соответствии с Федеральным законом No 218-ФЗ' => 4,
        'На основании пункта 5 части 1 статьи 7 218-ФЗ: на основании обращения источника формирования кредитной истории в случаях, установленных частью 7 статьи 5 218-ФЗ, если Правительством Российской Федерации установлено ограничение на передачу источниками формирования кредитной истории информации в бюро кредитных историй, а также если при определении дальнейших действий, которые должны совершить источники формирования кредитной истории с информацией, ранее предоставленной в бюро кредитных историй, в отношении субъекта кредитной истории, установлено, что указанная информация подлежит аннулированию в бюро кредитных историй' => 7
    ];

}
